In [1]:
# All imports
import pandas as pd
import numpy as np

# Input/Output

In [7]:
ts_data = pd.read_csv("../data/stock_data.csv")

In [8]:
# A look at the head of the dataframe
ts_data.head()

       date     AA    AAPL     GE     IBM    JNJ   MSFT    PEP      SPX    XOM
0  10/29/07  37.41  185.09  34.46  106.78  57.13  31.78  65.67  1540.98  85.51
1  10/30/07  36.43  187.00  34.39  106.15  56.99  32.70  65.80  1531.02  83.25
2  10/31/07  36.79  189.95  34.97  108.01  57.30  33.84  65.69  1549.38  84.03
3  11/01/07  35.22  187.44  34.27  105.72  56.85  34.07  64.51  1508.44  80.84
4  11/02/07  35.83  187.87  34.27  106.59  56.95  34.07  65.03  1509.65  80.32

In [9]:
#lets check the datatypes of columns in dataframe

ts_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   AA      1000 non-null   float64
 2   AAPL    1000 non-null   float64
 3   GE      1000 non-null   float64
 4   IBM     1000 non-null   float64
 5   JNJ     1000 non-null   float64
 6   MSFT    1000 non-null   float64
 7   PEP     1000 non-null   float64
 8   SPX     1000 non-null   float64
 9   XOM     1000 non-null   float64
dtypes: float64(9), object(1)
memory usage: 78.2+ KB

### A Quick look at pandas data types

![dtypes](https://github.com/poornagurram/TimeSeriesAnalysis_ODSC_2019/blob/master/images/pandas_dtypes.png?raw=1)

In [10]:
ts_data.describe()

,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,17.138190,217.386950,18.362250,122.687010,58.228900,24.947840,59.607930,1153.729090,71.513700
std,9.108915,90.627523,6.168905,26.797665,4.515169,3.746426,6.531849,183.562134,8.131698
min,5.100000,78.200000,6.190000,68.140000,42.760000,14.330000,42.460000,676.530000,54.850000
25%,11.027500,142.965000,14.690000,102.200000,55.867500,23.570000,56.535000,1048.495000,65.065000
50%,13.470000,193.970000,16.085000,120.340000,58.960000,25.375000,61.720000,1165.770000,70.905000
75%,17.427500,302.777500,20.282500,137.597500,61.110000,27.250000,63.785000,1306.157500,79.222500
max,41.860000,422.000000,34.970000,190.530000,67.320000,34.070000,71.250000,1549.380000,87.480000

In [11]:
#converts string type to datetime format
ts_data['Date']= pd.to_datetime(ts_data['date']) 
ts_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   AA      1000 non-null   float64
 2   AAPL    1000 non-null   float64
 3   GE      1000 non-null   float64
 4   IBM     1000 non-null   float64
 5   JNJ     1000 non-null   float64
 6   MSFT    1000 non-null   float64
 7   PEP     1000 non-null   float64
 8   SPX     1000 non-null   float64
 9   XOM     1000 non-null   float64
 10  Date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(9), object(1)
memory usage: 86.1+ KB

In [14]:
# read csv by parsing dates
df = pd.read_csv('../data/stock_data.csv', parse_dates=['date'], index_col=0)

In [15]:
df

               AA    AAPL     GE     IBM    JNJ   MSFT    PEP      SPX    XOM
date
2007-10-29  37.41  185.09  34.46  106.78  57.13  31.78  65.67  1540.98  85.51
2007-10-30  36.43  187.00  34.39  106.15  56.99  32.70  65.80  1531.02  83.25
2007-10-31  36.79  189.95  34.97  108.01  57.30  33.84  65.69  1549.38  84.03
2007-11-01  35.22  187.44  34.27  105.72  56.85  34.07  64.51  1508.44  80.84
2007-11-02  35.83  187.87  34.27  106.59  56.95  34.07  65.03  1509.65  80.32
...           ...     ...    ...     ...    ...    ...    ...      ...    ...
2011-10-10  10.09  388.81  16.14  186.62  64.43  26.94  61.87  1194.89  76.28
2011-10-11  10.30  400.29  16.14  185.00  63.96  27.00  60.95  1195.54  76.27
2011-10-12  10.05  402.19  16.40  186.12  64.33  26.96  62.70  1207.25  77.16
2011-10-13  10.10  408.43  16.22  186.82  64.23  27.18  62.36  1203.66  76.37
2011-10-14  10.26  422.00  16.60  190.53  64.72  27.27  62.24  1224.58  78.11

[1000 rows x 9 columns]

In [16]:
# getting data using date index
# [from 2008 october to 2009 january]
df['2008 10':'2009 01']

               AA    AAPL     GE     IBM    JNJ   MSFT    PEP      SPX    XOM
date
2008-10-01  20.07  109.12  21.71  104.02  61.19  24.71  65.31  1161.06  73.06
2008-10-02  18.29  100.10  19.63   98.93  61.19  24.49  64.64  1114.28  72.06
2008-10-03  18.16   97.07  19.11   97.70  59.72  24.56  62.90  1099.23  72.47
2008-10-06  17.09   98.14  18.94   95.04  58.22  23.24  60.75  1056.89  71.89
2008-10-07  15.77   89.16  17.99   90.35  56.40  21.68  59.36   996.23  70.73
...           ...     ...    ...     ...    ...    ...    ...      ...    ...
2009-01-26   7.99   89.64  11.22   87.00  51.47  16.56  47.24   836.57  73.50
2009-01-27   8.24   90.73  11.79   87.06  52.37  16.59  47.45   845.71  73.80
2009-01-28   8.37   94.20  12.19   90.06  53.30  16.95  47.81   874.09  74.11
2009-01-29   8.08   93.00  11.49   87.87  53.04  16.52  47.48   845.14  72.01
2009-01-30   7.45   90.13  10.95   87.05  52.50  16.06  46.15   825.88  71.52

[84 rows x 9 columns]

In [18]:
df.truncate(before='2008 10', after='2009')

               AA    AAPL     GE     IBM    JNJ   MSFT    PEP      SPX    XOM
date
2008-10-01  20.07  109.12  21.71  104.02  61.19  24.71  65.31  1161.06  73.06
2008-10-02  18.29  100.10  19.63   98.93  61.19  24.49  64.64  1114.28  72.06
2008-10-03  18.16   97.07  19.11   97.70  59.72  24.56  62.90  1099.23  72.47
2008-10-06  17.09   98.14  18.94   95.04  58.22  23.24  60.75  1056.89  71.89
2008-10-07  15.77   89.16  17.99   90.35  56.40  21.68  59.36   996.23  70.73
...           ...     ...    ...     ...    ...    ...    ...      ...    ...
2008-12-24   8.98   85.04  14.55   76.48  53.30  18.01  50.11   868.15  70.87
2008-12-26   9.36   85.81  14.42   77.25  53.30  17.97  50.13   872.80  72.18
2008-12-29   9.31   86.61  14.14   77.17  52.92  17.81  49.68   869.42  72.96
2008-12-30  10.23   86.29  14.29   79.36  53.85  18.17  50.42   890.64  73.49
2008-12-31  10.77   85.35  14.63   79.94  54.45  18.26  50.32   903.25  74.65

[64 rows x 9 columns]

In [45]:
# parsing date from multiple columns
pd.read_csv('../data/sample_2.csv').head()

   year  month  day    random
0  2018     11    1 -0.803908
1  2018     11    2  1.586827
2  2018     11    3  0.224112
3  2018     11    4 -0.715937
4  2018     11    5  0.010597

In [23]:
# combining all date columns to get date
pd.read_csv('../data/sample_2.csv', parse_dates={'date':[0,1,2]}, index_col='date').head()

              random
date
2018-11-01 -0.803908
2018-11-02  1.586827
2018-11-03  0.224112
2018-11-04 -0.715937
2018-11-05  0.010597

## dateparser

In [24]:
pd.read_csv('../data/sample.csv')

                    x    random
0   2018-11-01T0-10-1 -0.803908
1   2018-11-02T3-45-3  1.586827
2  2018-11-03T0-34-10  0.224112
3   2018-11-04T11-3-4 -0.715937

In [26]:
pd.read_csv('../data/sample.csv', parse_dates= ['x']).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       4 non-null      object
 1   random  4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes

In [27]:
from datetime import datetime

In [28]:
datetime.strptime('2018-11-01T12-12-00', '%Y-%m-%dT%H-%M-%S')

datetime.datetime(2018, 11, 1, 12, 12)

In [29]:
# Specifying the format to parse the datetime
# Find out various format specifiers here (https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior)
def dateparse(x):
    return datetime.strptime(x, '%Y-%m-%dT%H-%M-%S')

In [30]:
#pd.Timestamp('2018-11-01T0-10-1')

In [31]:
dateparse('2018-11-01T0-10-1')

datetime.datetime(2018, 11, 1, 0, 10, 1)

In [37]:
pd.read_csv('../data/sample.csv', parse_dates=['x'], date_parser=dateparse)

                    x    random
0 2018-11-01 00:10:01 -0.803908
1 2018-11-02 03:45:03  1.586827
2 2018-11-03 00:34:10  0.224112
3 2018-11-04 11:03:04 -0.715937

## Write data

In [38]:
# Creating date index with start and end having frequency of second
date_index = pd.date_range(start='20181217', freq='S', end='20181221')

In [39]:
len(date_index)

345601

In [40]:
# Generated Index
date_index

DatetimeIndex(['2018-12-17 00:00:00', '2018-12-17 00:00:01',
               '2018-12-17 00:00:02', '2018-12-17 00:00:03',
               '2018-12-17 00:00:04', '2018-12-17 00:00:05',
               '2018-12-17 00:00:06', '2018-12-17 00:00:07',
               '2018-12-17 00:00:08', '2018-12-17 00:00:09',
               ...
               '2018-12-20 23:59:51', '2018-12-20 23:59:52',
               '2018-12-20 23:59:53', '2018-12-20 23:59:54',
               '2018-12-20 23:59:55', '2018-12-20 23:59:56',
               '2018-12-20 23:59:57', '2018-12-20 23:59:58',
               '2018-12-20 23:59:59', '2018-12-21 00:00:00'],
              dtype='datetime64[ns]', length=345601, freq='S')

In [41]:
# Creating the dataframe with the above generated index
df = pd.DataFrame(data=np.random.randint(0,100, len(date_index)), index=date_index)

In [42]:
#changing name of the coloumn 
df.columns = ['Value']

In [43]:
#df.head()

In [44]:
# Exporting data to csv
df.to_csv('test_data.csv')